app/Http/Controllers/Traits/PhotoHelper.php

select `id` from `departments` where `parent_id` in (13) and `active` = 1
---
    protected function departmentWithChildIds(int|string $departmentId): array
    {
        return Cache::remember('dept_children_' . $departmentId, 3600, function () use ($departmentId) {
            $ids = collect([(int) $departmentId]);
            $parentIds = $ids;

            for ($i = 0; $i < 5; $i++) {
                // Only include active child departments
                $childIds = Department::whereIn('parent_id', $parentIds)->where('active', 1)->pluck('id');