app/Http/Controllers/CivilservantIdController.php

select `id`, `name_kh`, `parent_id`, `sort`, `active` from `departments` where (`parent_id` in (1, 2) or `id` in (1, 2)) and `active` = 1 order by CASE WHEN id = 1 OR parent_id = 1 THEN 0 WHEN id = 2 OR parent_id = 2 THEN 2 ELSE 1 END ASC, CASE WHEN id IN (1, 2) THEN 0 ELSE 1 END ASC, COALESCE(`sort`, id) ASC
---
    public function index(Request $request)
    {
        $request->validate([
            'name_kh'       => 'nullable|string|max:255',
            'department_id' => 'nullable|integer',
            'parent_id'     => 'nullable|integer',
            'position_id'   => 'nullable|integer',
            'has_document'  => 'nullable|boolean',
            'sort_by'       => 'nullable|string|in:' . implode(',', self::ALLOWED_SORTS),
            'sort_dir'      => 'nullable|string|in:asc,desc',
        ]);

        $filters = $request->only(['name_kh', 'department_id', 'parent_id', 'position_id', 'has_document', 'sort_by', 'sort_dir']);

        $query = CivilServant::with([
            'department.parent.parent',
            'position:id,name_kh,name_short,abb,sort',
        ])->select('civil_servants.*');

        $this->applyFilters($query, $request);
        $this->applySorting($query, $request);

        $departments = Cache::remember('dept_tree_top', 300, function () {
            return Department::select('id', 'name_kh', 'parent_id', 'sort', 'active')
                ->where(function ($q) {
                    $q->whereIn('parent_id', [1, 2])
                        ->orWhereIn('id', [1, 2]);
                })->where('active', 1)
                ->orderByRaw('CASE WHEN id = ? OR parent_id = ? THEN 0 WHEN id = ? OR parent_id = ? THEN 2 ELSE 1 END ASC', [1, 1, 2, 2])
                ->orderByRaw('CASE WHEN id IN (?, ?) THEN 0 ELSE 1 END ASC', [1, 2])
                ->orderByRaw('COALESCE(`sort`, id) ASC')
                ->get()->toArray();
        });

select `id`, `name_kh`, `parent_id`, `sort` from `departments` where `parent_id` in (1, 3, 4, 5, 6, 7, 12, 13, 9, 10, 11, 15, 17, 14, 8, 1361, 1355, 1616, 18, 2273, 2281, 2308, 1735, 19, 1824, 1743, 2025, 1607, 2231, 1604, 1826, 1730, 1733, 1980, 1981, 1982, 1984, 1985, 1986, 1987, 23, 2247, 1731, 2333, 2360, 2, 795, 796, 797, 798, 799, 800, 801, 802, 803, 804, 805, 806, 807, 808, 809, 810, 811, 812, 813, 814, 815, 816, 817, 818, 819) and `active` = 1 order by `sort` asc
---
            $childDepartments = collect($childDepartments)->map(fn($d) => (object) $d);
        }

        $allChildDepts = Cache::remember('dept_tree_all_children', 300, function () use ($departments) {
            return Department::select('id', 'name_kh', 'parent_id', 'sort')
                ->whereIn('parent_id', $departments->pluck('id'))
                ->where('active', 1)
                ->orderBy('sort')
                ->get()->toArray();
        });

select * from `departments` where `departments`.`id` = '7' limit 1
---
        $deptFilter = $request->input('parent_id') ?? $request->input('department_id');
        $deptLabel = null;
        if ($deptFilter) {
            $deptModel = Department::find($deptFilter);

select `civil_servants`.* from `civil_servants` where `civil_servants`.`id` = '5a6003ac-009c-4d82-85cb-43f6ac150cfb' limit 1
select * from `departments` where `departments`.`id` in (7, 24, 25, 27, 29, 30, 31, 32, 33, 34, 35, 37, 38, 45, 1421, 1489, 1523, 1748, 1749, 1750, 1790, 1962, 1963, 1964, 1967, 1968, 2149, 2233, 2234, 2235, 2236)
select `id`, `name_kh`, `name_short`, `abb`, `sort` from `positions` where `positions`.`id` in (7, 11, 16, 19, 20, 29, 32, 35, 36, 37, 42, 43, 44, 145, 217)
---
    public function downloadSinglePdf($id)
    {
        ini_set('memory_limit', '256M');
        set_time_limit(120);

        $cs = CivilServant::with([
            'department.parent.parent',
            'position:id,name_kh,name_short,abb,sort',
        ])->select('civil_servants.*')->findOrFail($id);

select `documents`.`id` as `doc_id`, `documents`.`name` as `doc_name`, `documents`.`code` from `document_deltas` inner join `documents` on `documents`.`id` = `document_deltas`.`document_id` where `document_deltas`.`civil_servant_id` = '5a6003ab-685c-4608-aebb-43f6ac150cfb' and `documents`.`document_type_id` = 16 order by `documents`.`id` asc
select `documents`.`id` as `doc_id`, `documents`.`name` as `doc_name`, `documents`.`code` from `document_deltas` inner join `documents` on `documents`.`id` = `document_deltas`.`document_id` where `document_deltas`.`civil_servant_id` = '5b039278-aea0-4270-9664-12d3ac150cfb' and `documents`.`document_type_id` = 16 order by `documents`.`id` asc
---
    public function downloadIdCardDocPdf($id)
    {
        set_time_limit(120);

        $baseUrl = rtrim(config('services.hrmis.document_base_url', 'https://mef-pd.net/hrmis/civilservant/viewDocument'), '/');

        $csName = $this->csFilename($id);

        // Find all documents linked to this civil servant with document_type_id = 16 (id cards)
        $documents = DB::table('document_deltas')
            ->join('documents', 'documents.id', '=', 'document_deltas.document_id')
            ->where('document_deltas.civil_servant_id', $id)
            ->where('documents.document_type_id', 16)
            ->select('documents.id as doc_id', 'documents.name as doc_name', 'documents.code')
            ->orderBy('documents.id')
            ->get();

        if ($documents->isEmpty()) {
            return redirect()->route('civilservant-id.index')
                ->with('error', 'មន្រ្តីរូបនេះមិនមានឯកសារអត្តសញ្ញណប័ណ្ណទេ។');

select `documents`.`id` as `doc_id`, `documents`.`name` as `doc_name`, `documents`.`code` from `document_deltas` inner join `documents` on `documents`.`id` = `document_deltas`.`document_id` where `document_deltas`.`civil_servant_id` = '5b039278-aea0-4270-9664-12d3ac150cfb' and `documents`.`document_type_id` = 10 order by `documents`.`id` asc
---
    public function downloadDeltaDocPdf($id)
    {
        set_time_limit(120);

        $baseUrl = rtrim(config('services.hrmis.document_base_url', 'https://mef-pd.net/hrmis/civilservant/viewDocument'), '/');

        $csName = $this->csFilename($id);

        // Find all documents linked to this civil servant with document_type_id = 10 (delta docs)
        $documents = DB::table('document_deltas')
            ->join('documents', 'documents.id', '=', 'document_deltas.document_id')
            ->where('document_deltas.civil_servant_id', $id)
            ->where('documents.document_type_id', 10)
            ->select('documents.id as doc_id', 'documents.name as doc_name', 'documents.code')
            ->orderBy('documents.id')
            ->get();

        if ($documents->isEmpty()) {
            return redirect()->route('civilservant-id.index')
                ->with('error', 'មន្រ្តីរូបនេះមិនមានឯកសារប្រភេទទី ១៦ទេ។');
        }

        $jar = $this->hrmisAuthenticatedClient();

        if ($documents->count() === 1) {
            // Stream single document directly
            $doc      = $documents->first();
            $response = Http::withOptions(['cookies' => $jar])->timeout(30)->get($baseUrl . '/' . $doc->doc_id);

select `last_name_kh`, `first_name_kh` from `civil_servants` where `id` = '5b039278-aea0-4270-9664-12d3ac150cfb' limit 1
---
    private function csFilename(int|string $id): string
    {
        $cs = DB::table('civil_servants')
            ->where('id', $id)
            ->select('last_name_kh', 'first_name_kh')
            ->first();

select distinct `document_deltas`.`civil_servant_id` from `document_deltas` inner join `documents` on `documents`.`id` = `document_deltas`.`document_id` where `documents`.`document_type_id` = 10
select distinct `document_deltas`.`civil_servant_id` from `document_deltas` inner join `documents` on `documents`.`id` = `document_deltas`.`document_id` where `documents`.`document_type_id` = 16
---
    private function getCivilServantIdsWithIdCard(): \Illuminate\Support\Collection
    {
        $ids = Cache::remember('civil_servant_ids_with_id_card', 300, function () {
            return DB::table('document_deltas')
                ->join('documents', 'documents.id', '=', 'document_deltas.document_id')
                ->where('documents.document_type_id', 16)
                ->distinct()
                ->pluck('document_deltas.civil_servant_id')
                ->all();
        });

select distinct `document_deltas`.`civil_servant_id` from `document_deltas` inner join `documents` on `documents`.`id` = `document_deltas`.`document_id` where `documents`.`document_type_id` = 10
---
    private function getCivilServantIdsWithDeltaDoc(): \Illuminate\Support\Collection
    {
        $ids = Cache::remember('civil_servant_ids_with_delta_doc', 300, function () {
            return DB::table('document_deltas')
                ->join('documents', 'documents.id', '=', 'document_deltas.document_id')
                ->where('documents.document_type_id', 10)
                ->distinct()
                ->pluck('document_deltas.civil_servant_id')
                ->all();

select * from `departments` where `departments`.`id` = 7 limit 1
select * from `departments` where `id` in (7, 24, 25, 27, 1421, 1489, 1523, 2149, 29, 30, 31, 32, 33, 1790, 34, 35, 37, 38, 45, 1910, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 2407, 1748, 1749, 1750, 2233, 2234, 2235, 2236)
---
    public function downloadDepartment(int $departmentId)
    {
        @set_time_limit(0);
        @ini_set('memory_limit', '512M');

        $deptIds = $this->departmentWithChildIds($departmentId);

        // Stream/stream-to-file approach similar to DepartmentController
        $csQuery = \App\Models\CivilServant::with(['department:id,parent_id,name_kh'])
            ->whereIn('department_id', $deptIds)
            ->where('status_type_id', 1);

        $csIterator = $csQuery->cursor();

        $dept = \App\Models\Department::find($departmentId);
        $deptName = ($dept && ! empty($dept->name_kh)) ? $dept->name_kh : 'department_' . $departmentId;

        // Load all departments in the tree keyed by id
        $allDepts = \App\Models\Department::whereIn('id', $deptIds)->get()->keyBy('id');

select `documents`.`id` as `doc_id`, `documents`.`name` as `doc_name` from `document_deltas` inner join `documents` on `documents`.`id` = `document_deltas`.`document_id` where `document_deltas`.`civil_servant_id` = '5a6003ab-5184-489f-b600-43f6ac150cfb' and `documents`.`document_type_id` = 16 order by `documents`.`id` asc
---
            $deptId = $civilServant->department_id;
            $folderPrefix = ($deptFolderPaths[$deptId] ?? $deptName) . '/';

            $documents = \Illuminate\Support\Facades\DB::table('document_deltas')
                ->join('documents', 'documents.id', '=', 'document_deltas.document_id')
                ->where('document_deltas.civil_servant_id', $civilServant->id)
                ->where('documents.document_type_id', 16)
                ->select('documents.id as doc_id', 'documents.name as doc_name')
                ->orderBy('documents.id')
                ->get();

select `id`, `name_kh`, `name_short`, `abb`, `sort` from `positions` where `active` = 1 and exists (select * from `civil_servants` where `positions`.`id` = `civil_servants`.`position_id` and `status_type_id` = 1) order by `sort` asc
---
    private function getFilteredPositions(Request $request): \Illuminate\Database\Eloquent\Collection
    {
        $posQuery = Position::select('id', 'name_kh', 'name_short', 'abb', 'sort')
            ->where('active', 1);

        if ($request->filled('parent_id')) {
            $deptIds = $this->departmentWithChildIds($request->input('parent_id'));
            $posQuery->whereHas('civilServants', function ($q) use ($deptIds) {
                $q->where('status_type_id', 1)->whereIn('department_id', $deptIds);
            });
        } elseif ($request->filled('department_id')) {
            $deptIds = $this->departmentWithChildIds($request->input('department_id'));
            $posQuery->whereHas('civilServants', function ($q) use ($deptIds) {
                $q->where('status_type_id', 1)->whereIn('department_id', $deptIds);
            });
        } else {
            $posQuery->whereHas('civilServants', function ($q) {
                $q->where('status_type_id', 1);
            });
        }

        if ($request->boolean('has_document')) {
            $ids = $this->getCivilServantIdsWithIdCard();
            if ($ids->isEmpty()) {
                // No positions if no matching civil servants
                $posQuery->whereRaw('0 = 1');
            } else {
                $posQuery->whereHas('civilServants', function ($q) use ($ids) {
                    $q->where('status_type_id', 1)->whereIn('civil_servants.id', $ids->all());
                });