app/Http/Controllers/CivilServantController.php

select `id`, `name_kh`, `parent_id`, `sort`, `active` from `departments` where (`parent_id` in (1, 2) or `id` in (1, 2)) and `active` = 1 order by CASE WHEN id = 1 OR parent_id = 1 THEN 0 WHEN id = 2 OR parent_id = 2 THEN 2 ELSE 1 END ASC, CASE WHEN id IN (1, 2) THEN 0 ELSE 1 END ASC, COALESCE(`sort`, id) ASC
---
        $this->applySorting($query, $request);

        $departments = Cache::remember('dept_tree_top', 300, function () {
            return Department::select('id', 'name_kh', 'parent_id', 'sort', 'active')
                ->where(function ($q) {
                    $q->whereIn('parent_id', [1, 2])
                        ->orWhereIn('id', [1, 2]);
                })->where('active', 1)
                ->orderByRaw('CASE WHEN id = ? OR parent_id = ? THEN 0 WHEN id = ? OR parent_id = ? THEN 2 ELSE 1 END ASC', [1, 1, 2, 2])
                ->orderByRaw('CASE WHEN id IN (?, ?) THEN 0 ELSE 1 END ASC', [1, 2])
                ->orderByRaw('COALESCE(`sort`, id) ASC')
                ->get()->toArray();

select `id`, `name_kh`, `parent_id`, `sort` from `departments` where `parent_id` in (1, 3, 4, 5, 6, 7, 12, 13, 9, 10, 11, 15, 17, 14, 8, 1361, 1355, 1616, 18, 2273, 2281, 2308, 1735, 19, 1824, 1743, 2025, 1607, 2231, 1604, 1826, 1730, 1733, 1980, 1981, 1982, 1984, 1985, 1986, 1987, 23, 2247, 1731, 2333, 2360, 2, 795, 796, 797, 798, 799, 800, 801, 802, 803, 804, 805, 806, 807, 808, 809, 810, 811, 812, 813, 814, 815, 816, 817, 818, 819) and `active` = 1 order by `sort` asc
---
            ]);
        }

        $allChildDepts = Cache::remember('dept_tree_all_children', 300, function () use ($departments) {
            return Department::select('id', 'name_kh', 'parent_id', 'sort')
                ->whereIn('parent_id', $departments->pluck('id'))
                ->where('active', 1)
                ->orderBy('sort')
                ->get()->toArray();
        });

select `id`, `name_kh`, `name_short`, `abb`, `sort` from `positions` where `active` = 1 and exists (select * from `civil_servants` where `positions`.`id` = `civil_servants`.`position_id` and `status_type_id` = 1) order by `sort` asc
---
    private function getFilteredPositions(Request $request): \Illuminate\Database\Eloquent\Collection
    {
        $posQuery = Position::select('id', 'name_kh', 'name_short', 'abb', 'sort')
            ->where('active', 1);

        if ($request->filled('parent_id')) {
            $deptIds = $this->departmentWithChildIds($request->input('parent_id'));
            $posQuery->whereHas('civilServants', function ($q) use ($deptIds) {
                $q->where('status_type_id', 1)->whereIn('department_id', $deptIds);
            });
        } elseif ($request->filled('department_id')) {
            $deptIds = $this->departmentWithChildIds($request->input('department_id'));
            $posQuery->whereHas('civilServants', function ($q) use ($deptIds) {
                $q->where('status_type_id', 1)->whereIn('department_id', $deptIds);
            });
        } else {
            $posQuery->whereHas('civilServants', function ($q) {
                $q->where('status_type_id', 1);
            });
        }

        return $posQuery->orderBy('sort')->get();