app/Http/Controllers/CivilServantController.php


        $childDepartments = [];
        if ($request->filled('department_id')) {
            $childDepartments = Department::where('parent_id', $request->input('department_id'))
                ->where('active', 1)
                ->orderBy('sort')
                ->get();
---
select * from `departments` where (`parent_id` in (1, 2) or `id` in (1, 2)) and `active` = 1 order by CASE WHEN id = 1 OR parent_id = 1 THEN 0 WHEN id = 2 OR parent_id = 2 THEN 2 ELSE 1 END ASC, CASE WHEN id IN (1, 2) THEN 0 ELSE 1 END ASC, COALESCE(`sort`, id) ASC

            ->get()
            ->groupBy('parent_id');

        return view('civil-servants.index', [
            'civilServants' => $query->paginate(20)->withQueryString(),
            'subDepartments' => $departments,
            'childDepartments' => $childDepartments,
            'allChildDepts' => $allChildDepts,
            'positions' => $this->getFilteredPositions($request),
            'filters' => $filters,
            'photoBaseUrl' => $this->photoBaseUrl(),
        ]);
---
select * from `departments` where `departments`.`id` in (3)
select * from `positions` where `positions`.`id` in (2, 151)

    public function ajaxSearch(Request $request): JsonResponse
    {
        if ($request->boolean('echo')) {
            return response()->json(['input' => $request->all()]);
        }

        $query = CivilServant::with(['department', 'position', 'images'])
            ->select('civil_servants.*')
            ->leftJoin('departments as dept', 'dept.id', '=', 'civil_servants.department_id')
            ->leftJoin('departments as sub_dept', 'sub_dept.id', '=', 'dept.parent_id')
            ->leftJoin('departments as parent_dept', 'parent_dept.id', '=', 'sub_dept.parent_id')
            ->addSelect(
                'dept.name_kh as department_name',
                'sub_dept.id as sub_department_id',
                'sub_dept.name_kh as sub_department_name',
                'parent_dept.id as parent_department_id',
                'parent_dept.name_kh as parent_department_name',
            );
        $this->applyFilters($query, $request);
        $this->applySorting($query, $request);

        return response()->json($query->get());
---
select * from `departments` where `departments`.`id` in (3)