app/Http/Controllers/CivilServantController.php


        $childDepartments = [];
        if ($request->filled('department_id')) {
            $childDepartments = Department::where('parent_id', $request->input('department_id'))
                ->where('active', 1)
                ->orderBy('sort')
                ->get();
---
select * from `departments` where `parent_id` in (1, 3, 4, 5, 6, 7, 12, 13, 9, 10, 11, 15, 17, 14, 8, 1361, 1355, 1616, 18, 2273, 2281, 2308, 1735, 19, 1824, 1743, 2025, 1607, 2231, 1604, 1826, 1730, 1733, 1980, 1981, 1982, 1984, 1985, 1986, 1987, 23, 2247, 1731, 2333, 2360, 2, 795, 796, 797, 798, 799, 800, 801, 802, 803, 804, 805, 806, 807, 808, 809, 810, 811, 812, 813, 814, 815, 816, 817, 818, 819) and `active` = 1 order by `sort` asc

    private function getFilteredPositions(Request $request): \Illuminate\Database\Eloquent\Collection
    {
        $posQuery = Position::where('active', 1)->whereHas('civilServants', function ($q) {
            $q->where('status_type_id', 1);
        });

        if ($request->filled('parent_id')) {
            $deptIds = $this->departmentWithChildIds($request->input('parent_id'));
            $posQuery->whereHas('civilServants', function ($q) use ($deptIds) {
                $q->where('status_type_id', 1)->whereIn('department_id', $deptIds);
            });
        } elseif ($request->filled('department_id')) {
            $deptIds = $this->departmentWithChildIds($request->input('department_id'));
            $posQuery->whereHas('civilServants', function ($q) use ($deptIds) {
                $q->where('status_type_id', 1)->whereIn('department_id', $deptIds);
            });
        }

        return $posQuery->orderBy('sort')->get();
---
select * from `positions` where `active` = 1 and exists (select * from `civil_servants` where `positions`.`id` = `civil_servants`.`position_id` and `status_type_id` = 1) order by `sort` asc