app/Http/Controllers/CivilServantPhotoController.php

    public function showPhoto(string $civilServantId): Response|RedirectResponse|StreamedResponse|BinaryFileResponse
    {
        $civilServant = CivilServant::with(['images', 'position'])->findOrFail($civilServantId);
---
select * from `civil_servants` where `civil_servants`.`id` = '5a6003ac-0140-41ca-af27-43f6ac150cfb' limit 1
select * from `images` where `images`.`civil_servant_id` in ('5a6003ac-0140-41ca-af27-43f6ac150cfb')
select * from `positions` where `positions`.`id` in (13)

    public function downloadPhoto(string $civilServantId): BinaryFileResponse
    {
        $civilServant = CivilServant::with(['images', 'position'])->findOrFail($civilServantId);
---
select * from `civil_servants` where `civil_servants`.`id` = '5a6003ab-1b48-4d4b-a711-43f6ac150cfb' limit 1
select * from `images` where `images`.`civil_servant_id` in ('5a6003ab-1b48-4d4b-a711-43f6ac150cfb')
select * from `positions` where `positions`.`id` in (151)