app/Http/Controllers/CivilservantIdController.php

select distinct `document_deltas`.`civil_servant_id` from `document_deltas` inner join `documents` on `documents`.`id` = `document_deltas`.`document_id` where `documents`.`document_type_id` = 10
---
    private function getCivilServantIdsWithIdCard(): \Illuminate\Support\Collection
    {
        $ids = Cache::remember('civil_servant_ids_with_id_card', 300, function () {
            return DB::table('document_deltas')
                ->join('documents', 'documents.id', '=', 'document_deltas.document_id')
                ->where('documents.document_type_id', 10)
                ->distinct()
                ->pluck('document_deltas.civil_servant_id')
                ->all();

select `id`, `name_kh`, `name_short`, `abb`, `sort` from `positions` where `active` = 1 and exists (select * from `civil_servants` where `positions`.`id` = `civil_servants`.`position_id` and `status_type_id` = 1) order by `sort` asc
---
    private function getFilteredPositions(Request $request): \Illuminate\Database\Eloquent\Collection
    {
        $posQuery = Position::select('id', 'name_kh', 'name_short', 'abb', 'sort')
            ->where('active', 1);

        if ($request->filled('parent_id')) {
            $deptIds = $this->departmentWithChildIds($request->input('parent_id'));
            $posQuery->whereHas('civilServants', function ($q) use ($deptIds) {
                $q->where('status_type_id', 1)->whereIn('department_id', $deptIds);
            });
        } elseif ($request->filled('department_id')) {
            $deptIds = $this->departmentWithChildIds($request->input('department_id'));
            $posQuery->whereHas('civilServants', function ($q) use ($deptIds) {
                $q->where('status_type_id', 1)->whereIn('department_id', $deptIds);
            });
        } else {
            $posQuery->whereHas('civilServants', function ($q) {
                $q->where('status_type_id', 1);
            });
        }

        return $posQuery->orderBy('sort')->get();